tiborsimon/embedded-tdd-headers/pic/8bit/pic18f87k90_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F87K90_H_
#define _PIC18F87K90_H_

#define LCDCON                        0
#define LMUX0                         1
#define LMUX                          2
#define LMUX1                         3
#define LCDCON_CS                     4
#define CS0                           5
#define CS1                           6
#define WERR                          7
#define SLPEN                         8
#define LCDEN                         9
#define LCDPS                         10
#define LP                            11
#define LP0                           12
#define LP1                           13
#define LP2                           14
#define LP3                           15
#define WA                            16
#define LCDA                          17
#define BIASMD                        18
#define WFT                           19
#define LCDSE0                        20
#define SE00                          21
#define SE01                          22
#define SE02                          23
#define SE03                          24
#define SE04                          25
#define SE05                          26
#define SE06                          27
#define SE07                          28
#define LCDSE1                        29
#define SE08                          30
#define SE09                          31
#define SE10                          32
#define SE11                          33
#define SE12                          34
#define SE13                          35
#define SE14                          36
#define SE15                          37
#define LCDSE2                        38
#define SE16                          39
#define SE17                          40
#define SE18                          41
#define SE19                          42
#define SE20                          43
#define SE21                          44
#define SE22                          45
#define SE23                          46
#define LCDSE3                        47
#define SE24                          48
#define SE25                          49
#define SE26                          50
#define SE27                          51
#define SE28                          52
#define SE29                          53
#define SE30                          54
#define SE31                          55
#define LCDSE4                        56
#define SE32                          57
#define SE33                          58
#define SE34                          59
#define SE35                          60
#define SE36                          61
#define SE37                          62
#define SE38                          63
#define SE39                          64
#define LCDSE5                        65
#define SE40                          66
#define SE41                          67
#define SE42                          68
#define SE43                          69
#define SE44                          70
#define SE45                          71
#define SE46                          72
#define SE47                          73
#define LCDRL                         74
#define LRLAT0                        75
#define LRLAT                         76
#define LRLAT1                        77
#define LRLAT2                        78
#define LRLBP                         79
#define LRLBP0                        80
#define LRLBP1                        81
#define LRLAP0                        82
#define LRLAP                         83
#define LRLAP1                        84
#define LCDREF                        85
#define VLCD1PE                       86
#define VLCD2PE                       87
#define VLCD3PE                       88
#define LCDCST0                       89
#define LCDCST                        90
#define LCDCST1                       91
#define LCDCST2                       92
#define LCDIRS                        93
#define LCDIRE                        94
#define SSP2CON2                      95
#define SEN2                          96
#define SSP2CON2_SEN                  97
#define ADMSK12                       98
#define SSP2CON2_RSEN                 99
#define RSEN2                         100
#define SSP2CON2_ADMSK1               101
#define ADMSK22                       102
#define PEN2                          103
#define SSP2CON2_PEN                  104
#define SSP2CON2_ADMSK2               105
#define ADMSK32                       106
#define SSP2CON2_RCEN                 107
#define RCEN2                         108
#define SSP2CON2_ADMSK3               109
#define ACKEN2                        110
#define ADMSK42                       111
#define SSP2CON2_ADMSK4               112
#define SSP2CON2_ACKEN                113
#define ACKDT2                        114
#define ADMSK52                       115
#define SSP2CON2_ACKDT                116
#define SSP2CON2_ADMSK5               117
#define SSP2CON2_ACKSTAT              118
#define ACKSTAT2                      119
#define SSP2CON2_GCEN                 120
#define GCEN2                         121
#define SSP2CON1                      122
#define SSP2CON1_SSPM                 123
#define SSP2CON1_SSPM0                124
#define SSPM02                        125
#define SSPM12                        126
#define SSP2CON1_SSPM1                127
#define SSP2CON1_SSPM2                128
#define SSPM22                        129
#define SSPM32                        130
#define SSP2CON1_SSPM3                131
#define SSP2CON1_CKP                  132
#define CKP2                          133
#define SSPEN2                        134
#define SSP2CON1_SSPEN                135
#define SSPOV2                        136
#define SSP2CON1_SSPOV                137
#define WCOL2                         138
#define SSP2CON1_WCOL                 139
#define SSP2STAT                      140
#define SSP2STAT_BF                   141
#define BF2                           142
#define SSP2STAT_UA                   143
#define UA2                           144
#define SSP2STAT_R_W                  145
#define SSP2STAT_I2C_READ             146
#define RW2                           147
#define SSP2STAT_R                    148
#define SSP2STAT_nW                   149
#define READ_WRITE2                   150
#define nW2                           151
#define SSP2STAT_nWRITE               152
#define I2C_READ2                     153
#define SSP2STAT_R_NOT_W              154
#define R_nW2                         155
#define SSP2STAT_READ_WRITE           156
#define nWRITE2                       157
#define R_W2                          158
#define SSP2STAT_R_nW                 159
#define SSP2STAT_NOT_WRITE            160
#define SSP2STAT_S                    161
#define S2                            162
#define START2                        163
#define SSP2STAT_I2C_START            164
#define I2C_START2                    165
#define P2                            166
#define SSP2STAT_I2C_STOP             167
#define SSP2STAT_P                    168
#define STOP2                         169
#define I2C_STOP2                     170
#define I2C_DAT2                      171
#define SSP2STAT_D                    172
#define DATA_ADDRESS2                 173
#define SSP2STAT_D_NOT_A              174
#define SSP2STAT_I2C_DAT              175
#define D_A2                          176
#define SSP2STAT_NOT_ADDRESS          177
#define SSP2STAT_D_nA                 178
#define SSP2STAT_DATA_ADDRESS         179
#define SSP2STAT_nADDRESS             180
#define nA2                           181
#define DA2                           182
#define nADDRESS2                     183
#define D_nA2                         184
#define SSP2STAT_nA                   185
#define SSP2STAT_D_A                  186
#define SSP2STAT_CKE                  187
#define CKE2                          188
#define SSP2STAT_SMP                  189
#define SMP2                          190
#define MSK02                         191
#define SSP2ADD                       192
#define SSP2ADD_MSK0                  193
#define MSK12                         194
#define SSP2ADD_MSK1                  195
#define MSK22                         196
#define SSP2ADD_MSK2                  197
#define MSK32                         198
#define SSP2ADD_MSK3                  199
#define MSK42                         200
#define SSP2ADD_MSK4                  201
#define MSK52                         202
#define SSP2ADD_MSK5                  203
#define MSK62                         204
#define SSP2ADD_MSK6                  205
#define MSK72                         206
#define SSP2ADD_MSK7                  207
#define SSP2BUF                       208
#define T4CON                         209
#define T4CKPS0                       210
#define T4CKPS                        211
#define T4CKPS1                       212
#define TMR4ON                        213
#define T4OUTPS                       214
#define T4OUTPS0                      215
#define T4OUTPS1                      216
#define T4OUTPS2                      217
#define T4OUTPS3                      218
#define PR4                           219
#define TMR4                          220
#define CCP7CON                       221
#define CCP7M0                        222
#define CCP7M                         223
#define CCP7M1                        224
#define CCP7M2                        225
#define CCP7M3                        226
#define DC7B                          227
#define CCP7Y                         228
#define DC7B0                         229
#define CCP7X                         230
#define DC7B1                         231
#define CCPR7L                        232
#define CCPR7H                        233
#define CCP6CON                       234
#define CCP6M                         235
#define CCP6M0                        236
#define CCP6M1                        237
#define CCP6M2                        238
#define CCP6M3                        239
#define CCP6Y                         240
#define DC6B0                         241
#define DC6B                          242
#define DC6B1                         243
#define CCP6X                         244
#define CCPR6L                        245
#define CCPR6H                        246
#define CCP5CON                       247
#define CCP5M0                        248
#define CCP5M                         249
#define CCP5M1                        250
#define CCP5M2                        251
#define CCP5M3                        252
#define CCP5Y                         253
#define DC5B0                         254
#define DC5B                          255
#define CCP5X                         256
#define DC5B1                         257
#define CCPR5L                        258
#define CCPR5H                        259
#define CCP4CON                       260
#define CCP4M                         261
#define CCP4M0                        262
#define CCP4M1                        263
#define CCP4M2                        264
#define CCP4M3                        265
#define CCP4Y                         266
#define DC4B0                         267
#define DC4B                          268
#define CCP4X                         269
#define DC4B1                         270
#define CCPR4L                        271
#define CCPR4H                        272
#define T5GCON                        273
#define T5GSS                         274
#define T5GSS0                        275
#define T5GSS1                        276
#define T5GVAL                        277
#define T5GGO_NOT_T5DONE              278
#define nT5DONE                       279
#define T5GGO_nT5DONE                 280
#define NOT_T5DONE                    281
#define T5GGO                         282
#define T5GSPM                        283
#define T5GTM                         284
#define T5GPOL                        285
#define TMR5GE                        286
#define T5CON                         287
#define TMR5ON                        288
#define T5CON_RD16                    289
#define RD165                         290
#define nT5SYNC                       291
#define NOT_T5SYNC                    292
#define SOSCEN5                       293
#define T5CON_SOSCEN                  294
#define T5CKPS                        295
#define T5CKPS0                       296
#define T5CKPS1                       297
#define TMR5CS0                       298
#define TMR5CS                        299
#define TMR5CS1                       300
#define TMR5L                         301
#define TMR5H                         302
#define PMD3                          303
#define TMR12MD                       304
#define CCP4MD                        305
#define CCP5MD                        306
#define CCP6MD                        307
#define CCP7MD                        308
#define CCP8MD                        309
#define CCP9MD                        310
#define CCP10MD                       311
#define PMD2                          312
#define CMP1MD                        313
#define CMP2MD                        314
#define CMP3MD                        315
#define TMR5MD                        316
#define TMR6MD                        317
#define TMR7MD                        318
#define TMR8MD                        319
#define TMR10MD                       320
#define PMD1                          321
#define TMR1MD                        322
#define TMR2MD                        323
#define TMR3MD                        324
#define TMR4MD                        325
#define RTCCMD                        326
#define CTMUMD                        327
#define PMD0                          328
#define ADCMD                         329
#define SSP1MD                        330
#define SPI1MD                        331
#define SPI2MD                        332
#define SSP2MD                        333
#define UART1MD                       334
#define UART2MD                       335
#define CCP1MD                        336
#define CCP2MD                        337
#define CCP3MD                        338
#define PSTR3CON                      339
#define PSTR3CON_STRA                 340
#define STRA3                         341
#define STRB3                         342
#define PSTR3CON_STRB                 343
#define PSTR3CON_STRC                 344
#define STRC3                         345
#define STRD3                         346
#define PSTR3CON_STRD                 347
#define STRSYNC3                      348
#define PSTR3CON_STRSYNC              349
#define PSTR3CON_CMPL0                350
#define CMPL03                        351
#define PSTR3CON_CMPL                 352
#define CMPL13                        353
#define PSTR3CON_CMPL1                354
#define PSTR2CON                      355
#define PSTR2CON_STRA                 356
#define P2DC02                        357
#define STRA2                         358
#define P2DC0CON                      359
#define STRB2                         360
#define P2DC12                        361
#define PSTR2CON_STRB                 362
#define P2DC1CON                      363
#define STRC2                         364
#define PSTR2CON_STRC                 365
#define P2DC22                        366
#define P2DC2CON                      367
#define P2DC32                        368
#define STRD2                         369
#define PSTR2CON_STRD                 370
#define P2DC3CON                      371
#define P2DC4CON                      372
#define STRSYNC2                      373
#define PSTR2CON_STRSYNC              374
#define P2DC42                        375
#define P2DC6CON                      376
#define PSTR2CON_CMPL                 377
#define CMPL02                        378
#define P2DC62                        379
#define PSTR2CON_CMPL0                380
#define CMPL12                        381
#define PSTR2CON_CMPL1                382
#define TXREG2                        383
#define RCREG2                        384
#define SPBRG2                        385
#define SPBRGH2                       386
#define BAUDCON2                      387
#define ABDEN2                        388
#define BAUDCON2_ABDEN                389
#define WUE2                          390
#define BAUDCON2_WUE                  391
#define BRG162                        392
#define BAUDCON2_BRG16                393
#define SCKP2                         394
#define TXCKP2                        395
#define BAUDCON2_TXCKP                396
#define DTRXP2                        397
#define RXDTP2                        398
#define BAUDCON2_RXDTP                399
#define RCMT2                         400
#define RCIDL2                        401
#define BAUDCON2_RCIDL                402
#define BAUDCON2_ABDOVF               403
#define ABDOVF2                       404
#define TXSTA2                        405
#define TX9D2                         406
#define TXSTA2_TX9D                   407
#define TXD82                         408
#define TRMT2                         409
#define TXSTA2_TRMT                   410
#define BRGH2                         411
#define TXSTA2_BRGH                   412
#define SENDB2                        413
#define TXSTA2_SENDB                  414
#define TXSTA2_SYNC                   415
#define SYNC2                         416
#define TXEN2                         417
#define TXSTA2_TXEN                   418
#define TX8_92                        419
#define TX92                          420
#define TXSTA2_TX9                    421
#define TXSTA2_CSRC                   422
#define CSRC2                         423
#define RCSTA2                        424
#define RCD82                         425
#define RX9D2                         426
#define RCSTA2_RX9D                   427
#define OERR2                         428
#define RCSTA2_OERR                   429
#define FERR2                         430
#define RCSTA2_FERR                   431
#define ADDEN2                        432
#define RCSTA2_ADDEN                  433
#define RCSTA2_CREN                   434
#define CREN2                         435
#define SREN2                         436
#define RCSTA2_SREN                   437
#define RC92                          438
#define RC8_92                        439
#define RCSTA2_RX9                    440
#define RX92                          441
#define RCSTA2_SPEN                   442
#define SPEN2                         443
#define ANCON2                        444
#define PCFG16                        445
#define ANSEL16                       446
#define PCFG17                        447
#define ANSEL17                       448
#define PCFG18                        449
#define ANSEL18                       450
#define PCFG19                        451
#define ANSEL19                       452
#define ANSEL20                       453
#define PCFG20                        454
#define ANSEL21                       455
#define PCFG21                        456
#define ANSEL22                       457
#define PCFG22                        458
#define ANSEL23                       459
#define PCFG23                        460
#define ANCON1                        461
#define ANSEL8                        462
#define PCFG8                         463
#define ANSEL9                        464
#define PCFG9                         465
#define PCFG10                        466
#define ANSEL10                       467
#define ANSEL11                       468
#define PCFG11                        469
#define PCFG12                        470
#define ANSEL12                       471
#define PCFG13                        472
#define ANSEL13                       473
#define PCFG14                        474
#define ANSEL14                       475
#define PCFG15                        476
#define ANSEL15                       477
#define ANCON0                        478
#define ANSEL0                        479
#define PCFG0                         480
#define ANSEL1                        481
#define PCFG1                         482
#define ANSEL2                        483
#define PCFG2                         484
#define ANSEL3                        485
#define PCFG3                         486
#define ANSEL4                        487
#define PCFG4                         488
#define ANSEL5                        489
#define PCFG5                         490
#define ANSEL6                        491
#define PCFG6                         492
#define ANSEL7                        493
#define PCFG7                         494
#define ODCON3                        495
#define CTMUDS                        496
#define U1OD                          497
#define U2OD                          498
#define ODCON2                        499
#define CCP3OD                        500
#define CCP4OD                        501
#define CCP5OD                        502
#define CCP6OD                        503
#define CCP7OD                        504
#define CCP8OD                        505
#define CCP9OD                        506
#define CCP10OD                       507
#define ODCON1                        508
#define SPI2OD                        509
#define CCP1OD                        510
#define CCP2OD                        511
#define SPI1OD                        512
#define REFOCON                       513
#define RODIV0                        514
#define RODIV                         515
#define RODIV1                        516
#define RODIV2                        517
#define RODIV3                        518
#define ROSEL                         519
#define ROSSLP                        520
#define ROON                          521
