tiborsimon/embedded-tdd-headers/pic/8bit/pic18f87k90_tdd.h
#define CCPTMRS2                      522
#define C8TSEL0                       523
#define C8TSEL                        524
#define C8TSEL1                       525
#define C9TSEL0                       526
#define C10TSEL0                      527
#define CCPTMRS1                      528
#define C4TSEL                        529
#define C4TSEL0                       530
#define C4TSEL1                       531
#define C5TSEL0                       532
#define C6TSEL0                       533
#define C7TSEL                        534
#define C7TSEL0                       535
#define C7TSEL1                       536
#define CCPTMRS0                      537
#define C1TSEL0                       538
#define C1TSEL                        539
#define C1TSEL1                       540
#define C1TSEL2                       541
#define C2TSEL0                       542
#define C2TSEL                        543
#define C2TSEL1                       544
#define C2TSEL2                       545
#define C3TSEL0                       546
#define C3TSEL                        547
#define C3TSEL1                       548
#define CM3CON                        549
#define CM3CON_CCH                    550
#define CCH03                         551
#define CM3CON_CCH0                   552
#define CCH13                         553
#define CM3CON_CCH1                   554
#define CM3CON_CREF                   555
#define CREF3                         556
#define CM3CON_EVPOL                  557
#define EVPOL03                       558
#define CM3CON_EVPOL0                 559
#define CM3CON_EVPOL1                 560
#define EVPOL13                       561
#define CM3CON_CPOL                   562
#define CPOL3                         563
#define COE3                          564
#define CM3CON_COE                    565
#define CM3CON_CON                    566
#define CON3                          567
#define CM2CON                        568
#define CM2CON_CCH                    569
#define CM2CON_CCH0                   570
#define CCH02                         571
#define CCH12                         572
#define CM2CON_CCH1                   573
#define CM2CON_CREF                   574
#define CREF2                         575
#define CM2CON_EVPOL                  576
#define EVPOL02                       577
#define CM2CON_EVPOL0                 578
#define EVPOL12                       579
#define CM2CON_EVPOL1                 580
#define CM2CON_CPOL                   581
#define CPOL2                         582
#define CM2CON_COE                    583
#define COE2                          584
#define CM2CON_CON                    585
#define CON2                          586
#define T12CON                        587
#define T12CKPS0                      588
#define T12CKPS                       589
#define T12CKPS1                      590
#define TMR12ON                       591
#define T12OUTPS0                     592
#define T12OUTPS                      593
#define T12OUTPS1                     594
#define T12OUTPS2                     595
#define T12OUTPS3                     596
#define PR12                          597
#define TMR12                         598
#define T10CON                        599
#define T10CKPS                       600
#define T10CKPS0                      601
#define T10CKPS1                      602
#define TMR10ON                       603
#define T10OUTPS0                     604
#define T10OUTPS                      605
#define T10OUTPS1                     606
#define T10OUTPS2                     607
#define T10OUTPS3                     608
#define PR10                          609
#define TMR10                         610
#define T8CON                         611
#define T8CKPS0                       612
#define T8CKPS                        613
#define T8CKPS1                       614
#define TMR8ON                        615
#define T8OUTPS                       616
#define T8OUTPS0                      617
#define T8OUTPS1                      618
#define T8OUTPS2                      619
#define T8OUTPS3                      620
#define PR8                           621
#define TMR8                          622
#define T6CON                         623
#define T6CKPS0                       624
#define T6CKPS                        625
#define T6CKPS1                       626
#define TMR6ON                        627
#define T6OUTPS0                      628
#define T6OUTPS                       629
#define T6OUTPS1                      630
#define T6OUTPS2                      631
#define T6OUTPS3                      632
#define PR6                           633
#define TMR6                          634
#define T7GCON                        635
#define T7GSS0                        636
#define T7GSS                         637
#define T7GSS1                        638
#define T7GVAL                        639
#define nT7DONE                       640
#define T7GGO_NOT_T7DONE              641
#define NOT_T7DONE                    642
#define T7GGO_nT7DONE                 643
#define T7GGO                         644
#define T7GSPM                        645
#define T7GTM                         646
#define T7GPOL                        647
#define TMR7GE                        648
#define T7CON                         649
#define TMR7ON                        650
#define T7CON_RD16                    651
#define RD167                         652
#define nT7SYNC                       653
#define NOT_T7SYNC                    654
#define SOSCEN7                       655
#define T7CON_SOSCEN                  656
#define T7CKPS                        657
#define T7CKPS0                       658
#define T7CKPS1                       659
#define TMR7CS                        660
#define TMR7CS0                       661
#define TMR7CS1                       662
#define TMR7L                         663
#define CAL07                         664
#define CAL17                         665
#define CAL27                         666
#define CAL37                         667
#define CAL47                         668
#define CAL57                         669
#define CAL67                         670
#define CAL77                         671
#define TMR7H                         672
#define CCP10CON                      673
#define CCP10M                        674
#define CCP10M0                       675
#define CCP10M1                       676
#define CCP10M2                       677
#define CCP10M3                       678
#define CCP10Y                        679
#define DC10B0                        680
#define DC10B                         681
#define CCP10X                        682
#define DC10B1                        683
#define CCPR10L                       684
#define CCPR10H                       685
#define CCP9CON                       686
#define CCP9M0                        687
#define CCP9M                         688
#define CCP9M1                        689
#define CCP9M2                        690
#define CCP9M3                        691
#define CCP9Y                         692
#define DC9B0                         693
#define DC9B                          694
#define CCP9X                         695
#define DC9B1                         696
#define CCPR9L                        697
#define CCPR9H                        698
#define CCP8CON                       699
#define CCP8M0                        700
#define CCP8M                         701
#define CCP8M1                        702
#define CCP8M2                        703
#define CCP8M3                        704
#define DC8B0                         705
#define CCP8Y                         706
#define DC8B                          707
#define DC8B1                         708
#define CCP8X                         709
#define CCPR8L                        710
#define CCPR8H                        711
#define CCP3CON                       712
#define CCP3M                         713
#define CCP3M0                        714
#define CCP3M1                        715
#define CCP3M2                        716
#define CCP3M3                        717
#define CCP3Y                         718
#define DC3B                          719
#define DC3B0                         720
#define DC3B1                         721
#define CCP3X                         722
#define P3M                           723
#define P3M0                          724
#define P3M1                          725
#define CCPR3L                        726
#define CCPR3H                        727
#define ECCP3DEL                      728
#define P3DC                          729
#define P3DC0                         730
#define P3DC1                         731
#define P3DC2                         732
#define P3DC3                         733
#define P3DC4                         734
#define P3DC5                         735
#define P3DC6                         736
#define P3RSEN                        737
#define PSS3BD0                       738
#define PSS3BD                        739
#define PSS3BD1                       740
#define PSS3AC0                       741
#define PSS3AC                        742
#define PSS3AC1                       743
#define ECCP3AS                       744
#define ECCP3AS0                      745
#define ECCP3AS1                      746
#define ECCP3AS2                      747
#define ECCP3ASE                      748
#define CCP2CON                       749
#define CCP2M                         750
#define CCP2M0                        751
#define CCP2M1                        752
#define CCP2M2                        753
#define CCP2M3                        754
#define DC2B                          755
#define DC2B0                         756
#define CCP2Y                         757
#define DC2B1                         758
#define CCP2X                         759
#define P2M                           760
#define P2M0                          761
#define P2M1                          762
#define CCPR2L                        763
#define CCPR2H                        764
#define ECCP2DEL                      765
#define P2DC                          766
#define P2DC0                         767
#define P2DC1                         768
#define P2DC2                         769
#define P2DC3                         770
#define P2DC4                         771
#define P2DC5                         772
#define P2DC6                         773
#define P2RSEN                        774
#define PSS2BD                        775
#define PSS2BD0                       776
#define PSS2BD1                       777
#define PSS2AC0                       778
#define PSS2AC                        779
#define PSS2AC1                       780
#define ECCP2AS0                      781
#define ECCP2AS                       782
#define ECCP2AS1                      783
#define ECCP2AS2                      784
#define ECCP2ASE                      785
#define PADCFG1                       786
#define RTSECSEL0                     787
#define RTSECSEL                      788
#define RTSECSEL1                     789
#define PADCFG1_RJPU                  790
#define REPU                          791
#define RDPU                          792
#define CM1CON                        793
#define CM1CON_CCH                    794
#define C1CH0                         795
#define CM1CON_CCH0                   796
#define CCH01                         797
#define CCH11                         798
#define C1CH1                         799
#define CM1CON_CCH1                   800
#define CM1CON_CREF                   801
#define CREF1                         802
#define EVPOL01                       803
#define CM1CON_EVPOL0                 804
#define CM1CON_EVPOL                  805
#define CM1CON_EVPOL1                 806
#define EVPOL11                       807
#define CM1CON_CPOL                   808
#define CPOL1                         809
#define CM1CON_COE                    810
#define COE1                          811
#define CM1CON_CON                    812
#define CON1                          813
#define CTMUICON                      814
#define IRNG                          815
#define IRNG0                         816
#define IRNG1                         817
#define ITRIM0                        818
#define ITRIM                         819
#define ITRIM1                        820
#define ITRIM2                        821
#define ITRIM3                        822
#define ITRIM4                        823
#define ITRIM5                        824
#define CTMUCONL                      825
#define EDG1STAT                      826
#define EDG2STAT                      827
#define EDG1SEL                       828
#define EDG1SEL0                      829
#define EDG1SEL1                      830
#define EDG1POL                       831
#define EDG2SEL0                      832
#define EDG2SEL                       833
#define EDG2SEL1                      834
#define EDG2POL                       835
#define CTMUCONH                      836
#define CTTRIG                        837
#define IDISSEN                       838
#define EDGSEQEN                      839
#define EDGEN                         840
#define TGEN                          841
#define CTMUSIDL                      842
#define CTMUEN                        843
#define ALRMVALL                      844
#define ALRMVALH                      845
#define ALRMRPT                       846
#define ARPT0                         847
#define ARPT                          848
#define ARPT1                         849
#define ARPT2                         850
#define ARPT3                         851
#define ARPT4                         852
#define ARPT5                         853
#define ARPT6                         854
#define ARPT7                         855
#define ALRMCFG                       856
#define ALRMPTR                       857
#define ALRMPTR0                      858
#define ALRMPTR1                      859
#define AMASK0                        860
#define AMASK                         861
#define AMASK1                        862
#define AMASK2                        863
#define AMASK3                        864
#define CHIME                         865
#define ALRMEN                        866
#define RTCVALL                       867
#define WAITE0                        868
#define RTCVALH                       869
#define WAITE1                        870
#define WAITM0                        871
#define WAITM1                        872
#define WAITM2                        873
#define WAITM3                        874
#define WAITB0                        875
#define WAITB1                        876
#define RTCCAL                        877
#define CAL0                          878
#define CAL                           879
#define CAL1                          880
#define CAL2                          881
#define CAL3                          882
#define CAL4                          883
#define CAL5                          884
#define CAL6                          885
#define CAL7                          886
#define RTCCFG                        887
#define RTCPTR0                       888
#define RTCPTR                        889
#define RTCPTR1                       890
#define RTCOE                         891
#define HALFSEC                       892
#define RTCSYNC                       893
#define RTCWREN                       894
#define RTCEN                         895
#define PIE6                          896
#define CMP1IE                        897
#define CMP2IE                        898
#define CMP3IE                        899
#define EEIE                          900
#define EEDATA                        901
#define EEADR                         902
#define EEADRH                        903
#define OSCCON2                       904
#define MFIOSEL                       905
#define MFIOFS                        906
#define SOSCGO                        907
#define SOSCRUN                       908
#define BAUDCON1                      909
#define BAUDCON1_ABDEN                910
#define ABDEN1                        911
#define BAUDCON1_WUE                  912
#define WUE1                          913
#define W4E                           914
#define BRG161                        915
#define BAUDCON1_BRG16                916
#define CKTXP                         917
#define BAUDCON1_TXCKP                918
#define SCKP1                         919
#define TXCKP1                        920
#define SCKP                          921
#define DTRXP1                        922
#define RXDTP1                        923
#define DTRXP                         924
#define RXCKP                         925
#define BAUDCON1_RXDTP                926
#define RCMT1                         927
#define RCIDL1                        928
#define BAUDCON1_RCIDL                929
#define RCMT                          930
#define ABDOVF1                       931
#define BAUDCON1_ABDOVF               932
#define LCDDATA0                      933
#define S00C0                         934
#define S01C0                         935
#define S02C0                         936
#define S03C0                         937
#define S04C0                         938
#define S05C0                         939
#define S06C0                         940
#define S07C0                         941
#define LCDDATA1                      942
#define S08C0                         943
#define S09C0                         944
#define S10C0                         945
#define S11C0                         946
#define S12C0                         947
#define S13C0                         948
#define S14C0                         949
#define S15C0                         950
#define LCDDATA2                      951
#define S16C0                         952
#define S17C0                         953
#define S18C0                         954
#define S19C0                         955
#define S20C0                         956
#define S21C0                         957
#define S22C0                         958
#define S23C0                         959
#define LCDDATA3                      960
#define S24C0                         961
#define S25C0                         962
#define S26C0                         963
#define S27C0                         964
#define S28C0                         965
#define S29C0                         966
#define S30C0                         967
#define S31C0                         968
#define LCDDATA4                      969
#define S32C0                         970
#define S33C0                         971
#define S34C0                         972
#define S35C0                         973
#define S36C0                         974
#define S37C0                         975
#define S38C0                         976
#define S39C0                         977
#define LCDDATA5                      978
#define S40C0                         979
#define S40C15                        980
#define S41C0                         981
#define S42C0                         982
#define S43C0                         983
#define S44C0                         984
#define S45C0                         985
#define S46C0                         986
#define S47C0                         987
#define LCDDATA6                      988
#define S00C1                         989
#define S01C1                         990
#define S02C1                         991
#define S03C1                         992
#define S04C1                         993
#define S05C1                         994
#define S06C1                         995
#define S07C1                         996
#define LCDDATA7                      997
#define S08C1                         998
#define S09C1                         999
#define S10C1                         1000
#define S11C1                         1001
#define S12C1                         1002
#define S13C1                         1003
#define S14C1                         1004
#define S15C1                         1005
#define LCDDATA8                      1006
#define S16C1                         1007
#define S17C1                         1008
#define S18C1                         1009
#define S19C1                         1010
#define S20C1                         1011
#define S21C1                         1012
#define S22C1                         1013
#define S23C1                         1014
#define LCDDATA9                      1015
#define S24C1                         1016
#define S25C1                         1017
#define S26C1                         1018
#define S27C1                         1019
#define S28C1                         1020
#define S29C1                         1021
#define S30C1                         1022
#define S31C1                         1023
#define LCDDATA10                     1024
#define S32C1                         1025
#define S33C1                         1026
#define S34C1                         1027
#define S35C1                         1028
#define S36C1                         1029
#define S37C1                         1030
#define S38C1                         1031
#define S39C1                         1032
#define LCDDATA11                     1033
#define S40C1                         1034
#define LCDDATA11_ADMSK1              1035
#define S41C1                         1036
#define S42C1                         1037
#define LCDDATA11_ADMSK2              1038
#define LCDDATA11_ADMSK3              1039
#define S43C1                         1040
#define LCDDATA11_ADMSK4              1041
#define S44C1                         1042
#define LCDDATA11_ADMSK5              1043
#define S45C1                         1044
#define S46C1                         1045
#define S47C1                         1046
#define LCDDATA12                     1047
#define SSPM012                       1048
#define S00C2                         1049
#define S01C2                         1050
#define SSPM112                       1051
#define SSPM212                       1052
#define S02C2                         1053
#define S03C2                         1054
#define SSPM312                       1055
#define S04C2                         1056
#define S05C2                         1057
#define S06C2                         1058
#define S07C2                         1059
#define LCDDATA13                     1060
#define S08C2                         1061
#define S09C2                         1062
#define S10C2                         1063
#define S11C2                         1064
#define S12C2                         1065
#define S13C2                         1066
#define S14C2                         1067
#define S15C2                         1068
#define LCDDATA14                     1069
#define LCDDATA14_MSK0                1070
#define S16C2                         1071
#define LCDDATA14_MSK1                1072
#define S17C2                         1073
#define LCDDATA14_MSK2                1074
#define S18C2                         1075
#define S19C2                         1076
#define LCDDATA14_MSK3                1077
#define LCDDATA14_MSK4                1078
#define S20C2                         1079
#define LCDDATA14_MSK5                1080
#define S21C2                         1081
#define LCDDATA14_MSK6                1082
#define S22C2                         1083
#define LCDDATA14_MSK7                1084
#define S23C2                         1085
#define LCDDATA15                     1086
#define S24C2                         1087
#define S25C2                         1088
#define S26C2                         1089
#define S27C2                         1090
