tiborsimon/embedded-tdd-headers/pic/8bit/pic18f87k90_tdd.h
#define S28C2                         1091
#define S29C2                         1092
#define S30C2                         1093
#define S31C2                         1094
#define LCDDATA16                     1095
#define S32C2                         1096
#define T4CKPS016                     1097
#define T4CKPS116                     1098
#define S33C2                         1099
#define S34C2                         1100
#define T4OUTPS016                    1101
#define S35C2                         1102
#define S36C2                         1103
#define T4OUTPS116                    1104
#define T4OUTPS216                    1105
#define S37C2                         1106
#define S38C2                         1107
#define T4OUTPS316                    1108
#define S39C2                         1109
#define LCDDATA17                     1110
#define S40C2                         1111
#define S41C2                         1112
#define S42C2                         1113
#define S43C2                         1114
#define S44C2                         1115
#define S45C2                         1116
#define S46C2                         1117
#define S47C2                         1118
#define LCDDATA18                     1119
#define S00C3                         1120
#define S01C3                         1121
#define S02C3                         1122
#define S03C3                         1123
#define S04C3                         1124
#define S05C3                         1125
#define S06C3                         1126
#define S07C3                         1127
#define LCDDATA19                     1128
#define S08C3                         1129
#define S09C3                         1130
#define S10C3                         1131
#define S11C3                         1132
#define S12C3                         1133
#define T3CKPS019                     1134
#define T3CKPS119                     1135
#define S13C3                         1136
#define S14C3                         1137
#define TMR3CS019                     1138
#define TMR3CS119                     1139
#define S15C3                         1140
#define LCDDATA20                     1141
#define S16C3                         1142
#define S17C3                         1143
#define S18C3                         1144
#define S19C3                         1145
#define S20C3                         1146
#define S21C3                         1147
#define S22C3                         1148
#define S23C3                         1149
#define LCDDATA21                     1150
#define S24C3                         1151
#define S25C3                         1152
#define S26C3                         1153
#define S27C3                         1154
#define S28C3                         1155
#define S29C3                         1156
#define S30C3                         1157
#define S31C3                         1158
#define LCDDATA22                     1159
#define S32C3                         1160
#define S33C3                         1161
#define S34C3                         1162
#define S35C3                         1163
#define S36C3                         1164
#define S37C3                         1165
#define S38C3                         1166
#define S39C3                         1167
#define LCDDATA23                     1168
#define S40C3                         1169
#define S41C3                         1170
#define S42C3                         1171
#define S43C3                         1172
#define S44C3                         1173
#define S45C3                         1174
#define S46C3                         1175
#define S47C3                         1176
#define EECON2                        1177
#define EECON1                        1178
#define EECON1_RD                     1179
#define EECON1_WR                     1180
#define WREN                          1181
#define WRERR                         1182
#define FREE                          1183
#define CFGS                          1184
#define EEFS                          1185
#define EEPGD                         1186
#define PORTA                         1187
#define ULPWUIN                       1188
#define AN0                           1189
#define RA0                           1190
#define SEG18                         1191
#define AN1                           1192
#define RA1                           1193
#define AN2                           1194
#define RA2                           1195
#define VREF_MINUS                    1196
#define AN3                           1197
#define VREF_PLUS                     1198
#define RA3                           1199
#define SEG14                         1200
#define T0CKI                         1201
#define RA4                           1202
#define SEG15                         1203
#define AN4                           1204
#define T1CKI                         1205
#define LVDIN                         1206
#define RA5                           1207
#define T3G                           1208
#define CLKO                          1209
#define RA6                           1210
#define OSC2                          1211
#define CLKI                          1212
#define PORTA_RJPU                    1213
#define RA7                           1214
#define OSC1                          1215
#define PORTB                         1216
#define SEG30                         1217
#define FLT0                          1218
#define RB0                           1219
#define INT0                          1220
#define RB1                           1221
#define INT1                          1222
#define SEG8                          1223
#define RB2                           1224
#define INT2                          1225
#define CTED1                         1226
#define SEG9                          1227
#define SEG10                         1228
#define RB3                           1229
#define INT3                          1230
#define CCP2_PA2                      1231
#define CTED2                         1232
#define SEG11                         1233
#define RB4                           1234
#define KBI0                          1235
#define PGM                           1236
#define T3CKI                         1237
#define RB5                           1238
#define SEG29                         1239
#define KBI1                          1240
#define T1G                           1241
#define PGC                           1242
#define RB6                           1243
#define KBI2                          1244
#define PGD                           1245
#define RB7                           1246
#define KBI3                          1247
#define PORTC                         1248
#define SCKLI                         1249
#define RC0                           1250
#define SOSCO                         1251
#define SEG32                         1252
#define PORTC_PA2                     1253
#define PORTC_CCP2                    1254
#define RC1                           1255
#define SOSCI                         1256
#define SEG13                         1257
#define CCP1                          1258
#define PA1                           1259
#define RC2                           1260
#define SEG17                         1261
#define SCK1                          1262
#define SCL1                          1263
#define RC3                           1264
#define SEG16                         1265
#define SDI1                          1266
#define SDA1                          1267
#define RC4                           1268
#define SEG12                         1269
#define SDO1                          1270
#define RC5                           1271
#define SEG27                         1272
#define TX1                           1273
#define RC6                           1274
#define CK1                           1275
#define DT1                           1276
#define RX1                           1277
#define SEG28                         1278
#define RC7                           1279
#define PORTD                         1280
#define PSP0                          1281
#define RD0                           1282
#define CTPLS                         1283
#define AD0                           1284
#define SEG0                          1285
#define PSP1                          1286
#define RD1                           1287
#define T5CKI                         1288
#define T7G                           1289
#define AD1                           1290
#define SEG1                          1291
#define PSP2                          1292
#define RD2                           1293
#define AD2                           1294
#define SEG2                          1295
#define PSP3                          1296
#define RD3                           1297
#define AD3                           1298
#define SEG3                          1299
#define PSP4                          1300
#define RD4                           1301
#define AD4                           1302
#define SDO2                          1303
#define SEG4                          1304
#define PSP5                          1305
#define RD5                           1306
#define SDI2                          1307
#define AD5                           1308
#define SDA2                          1309
#define SEG5                          1310
#define SEG6                          1311
#define SCK2                          1312
#define PSP6                          1313
#define RD6                           1314
#define AD6                           1315
#define SCL2                          1316
#define SS2                           1317
#define PSP7                          1318
#define RD7                           1319
#define AD7                           1320
#define SEG7                          1321
#define PORTE                         1322
#define PD2                           1323
#define AD8                           1324
#define PORTE_RD                      1325
#define RDE                           1326
#define LCDBIAS1                      1327
#define RE0                           1328
#define AD9                           1329
#define PORTE_WR                      1330
#define WRE                           1331
#define LCDBIAS2                      1332
#define RE1                           1333
#define PC2                           1334
#define PORTE_CS                      1335
#define PB2                           1336
#define CCP10                         1337
#define AD10                          1338
#define LCDBIAS3                      1339
#define RE2                           1340
#define PORTE_CCP9                    1341
#define COM0                          1342
#define PORTE_PC3                     1343
#define CCP9E                         1344
#define AD11                          1345
#define RE3                           1346
#define PC3E                          1347
#define PORTE_CCP8                    1348
#define PB3E                          1349
#define COM1                          1350
#define PORTE_PB3                     1351
#define REFO                          1352
#define AD12                          1353
#define RE4                           1354
#define CCP8E                         1355
#define PORTE_CCP7                    1356
#define COM2                          1357
#define PORTE_PC1                     1358
#define CCP7E                         1359
#define AD13                          1360
#define RE5                           1361
#define PC1E                          1362
#define PORTE_CCP6                    1363
#define CCP6E                         1364
#define COM3                          1365
#define AD14                          1366
#define RE6                           1367
#define PB1E                          1368
#define PORTE_PB1                     1369
#define PORTE_CCP2                    1370
#define CCP2E                         1371
#define SEG31                         1372
#define PA2E                          1373
#define PORTE_PA2                     1374
#define AD15                          1375
#define RE7                           1376
#define PORTF                         1377
#define SEG19                         1378
#define C2OUTF                        1379
#define AN6                           1380
#define PORTF_C2OUT                   1381
#define RF1                           1382
#define CTDIN                         1383
#define PORTF_C1OUT                   1384
#define AN7                           1385
#define RF2                           1386
#define C1OUTF                        1387
#define SEG20                         1388
#define AN8                           1389
#define RF3                           1390
#define SEG21                         1391
#define CTMUI                         1392
#define C2INB                         1393
#define AN9                           1394
#define RF4                           1395
#define SEG22                         1396
#define C2INA                         1397
#define C1INB                         1398
#define RF5                           1399
#define SEG23                         1400
#define CVREF                         1401
#define AN10                          1402
#define C1INA                         1403
#define RF6                           1404
#define SEG24                         1405
#define AN11                          1406
#define SS1                           1407
#define AN5                           1408
#define RF7                           1409
#define SEG25                         1410
#define PORTG                         1411
#define CCP3                          1412
#define PA3                           1413
#define RG0                           1414
#define C3OUTG                        1415
#define PORTG_C3OUT                   1416
#define TX2                           1417
#define RG1                           1418
#define CK2                           1419
#define AN19                          1420
#define C3INA                         1421
#define RX2                           1422
#define RG2                           1423
#define DT2                           1424
#define AN18                          1425
#define CCP4                          1426
#define PD3                           1427
#define C3INB                         1428
#define RG3                           1429
#define AN17                          1430
#define CCP5                          1431
#define PD1                           1432
#define SEG26                         1433
#define C3INC                         1434
#define T7CKI                         1435
#define T5G                           1436
#define RG4                           1437
#define RTCC                          1438
#define AN16                          1439
#define PORTG_RJPU                    1440
#define RG5                           1441
#define PORTH                         1442
#define RH0                           1443
#define A16                           1444
#define SEG47                         1445
#define AN23                          1446
#define RH1                           1447
#define A17                           1448
#define SEG46                         1449
#define AN22                          1450
#define RH2                           1451
#define A18                           1452
#define SEG45                         1453
#define AN21                          1454
#define RH3                           1455
#define A19                           1456
#define SEG44                         1457
#define AN20                          1458
#define PORTH_CCP9                    1459
#define RH4                           1460
#define SEG40                         1461
#define C2INC                         1462
#define PORTH_PC3                     1463
#define AN12                          1464
#define PORTH_CCP8                    1465
#define RH5                           1466
#define SEG41                         1467
#define PORTH_PB3                     1468
#define AN13                          1469
#define C2IND                         1470
#define C1INC                         1471
#define RH6                           1472
#define SEG42                         1473
#define PORTH_CCP7                    1474
#define PORTH_PC1                     1475
#define AN14                          1476
#define RH7                           1477
#define PORTH_CCP6                    1478
#define SEG43                         1479
#define PORTH_PB1                     1480
#define AN15                          1481
#define PORTJ                         1482
#define RJ0                           1483
#define ALE                           1484
#define RJ1                           1485
#define SEG33                         1486
#define OE                            1487
#define RJ2                           1488
#define SEG34                         1489
#define WRL                           1490
#define RJ3                           1491
#define SEG35                         1492
#define WRH                           1493
#define RJ4                           1494
#define SEG39                         1495
#define BA0                           1496
#define RJ5                           1497
#define SEG38                         1498
#define CE                            1499
#define RJ6                           1500
#define SEG37                         1501
#define LB                            1502
#define RJ7                           1503
#define SEG36                         1504
#define UB                            1505
#define LATA                          1506
#define LATA0                         1507
#define LA0                           1508
#define LATA1                         1509
#define LA1                           1510
#define LATA2                         1511
#define LA2                           1512
#define LATA3                         1513
#define LA3                           1514
#define LATA4                         1515
#define LA4                           1516
#define LATA5                         1517
#define LA5                           1518
#define LATA6                         1519
#define LA6                           1520
#define LATA7                         1521
#define LA7                           1522
#define LATB                          1523
#define LB0                           1524
#define LATB0                         1525
#define LB1                           1526
#define LATB1                         1527
#define LB2                           1528
#define LATB2                         1529
#define LB3                           1530
#define LATB3                         1531
#define LB4                           1532
#define LATB4                         1533
#define LB5                           1534
#define LATB5                         1535
#define LB6                           1536
#define LATB6                         1537
#define LB7                           1538
#define LATB7                         1539
#define LATC                          1540
#define LATC0                         1541
#define LC0                           1542
#define LATC1                         1543
#define LC1                           1544
#define LATC2                         1545
#define LC2                           1546
#define LATC3                         1547
#define LC3                           1548
#define LATC4                         1549
#define LC4                           1550
#define LATC5                         1551
#define LC5                           1552
#define LATC6                         1553
#define LC6                           1554
#define LATC7                         1555
#define LC7                           1556
#define LATD                          1557
#define LATD0                         1558
#define LD0                           1559
#define LATD1                         1560
#define LD1                           1561
#define LATD2                         1562
#define LD2                           1563
#define LATD3                         1564
#define LD3                           1565
#define LATD4                         1566
#define LD4                           1567
#define LATD5                         1568
#define LD5                           1569
#define LATD6                         1570
#define LD6                           1571
#define LATD7                         1572
#define LD7                           1573
#define LATE                          1574
#define LATE0                         1575
#define LE0                           1576
#define LATE1                         1577
#define LE1                           1578
#define LATE2                         1579
#define LE2                           1580
#define LATE3                         1581
#define LE3                           1582
#define LATE4                         1583
#define LE4                           1584
#define LATE5                         1585
#define LE5                           1586
#define LATE6                         1587
#define LE6                           1588
#define LATE7                         1589
#define LE7                           1590
#define LATF                          1591
#define LATF1                         1592
#define LF1                           1593
#define LF2                           1594
#define LATF2                         1595
#define LF3                           1596
#define LATF3                         1597
#define LF4                           1598
#define LATF4                         1599
#define LF5                           1600
#define LATF5                         1601
#define LF6                           1602
#define LATF6                         1603
#define LF7                           1604
#define LATF7                         1605
#define LATG                          1606
#define LATG0                         1607
#define LG0                           1608
#define LATG1                         1609
#define LG1                           1610
#define LATG2                         1611
#define LG2                           1612
#define LATG3                         1613
#define LG3                           1614
#define LATG4                         1615
#define LG4                           1616
#define LATH                          1617
#define LH0                           1618
#define LATH0                         1619
#define LH1                           1620
#define LATH1                         1621
#define LH2                           1622
#define LATH2                         1623
#define LH3                           1624
#define LATH3                         1625
#define LH4                           1626
#define LATH4                         1627
#define LH5                           1628
#define LATH5                         1629
#define LH6                           1630
#define LATH6                         1631
#define LH7                           1632
#define LATH7                         1633
#define LATJ                          1634
#define LATJ0                         1635
#define LJ0                           1636
#define LATJ1                         1637
#define LJ1                           1638
#define LATJ2                         1639
#define LJ2                           1640
#define LATJ3                         1641
#define LJ3                           1642
#define LATJ4                         1643
#define LJ4                           1644
#define LATJ5                         1645
#define LJ5                           1646
#define LATJ6                         1647
#define LJ6                           1648
