tiborsimon/embedded-tdd-headers/pic/8bit/pic18f87k90_tdd.h
#define LATJ7                         1649
#define LJ7                           1650
#define TRISA                         1651
#define TRISA0                        1652
#define TRISA1                        1653
#define TRISA2                        1654
#define TRISA3                        1655
#define TRISA4                        1656
#define TRISA5                        1657
#define TRISA6                        1658
#define TRISA7                        1659
#define TRISB                         1660
#define TRISB0                        1661
#define TRISB1                        1662
#define TRISB2                        1663
#define TRISB3                        1664
#define TRISB4                        1665
#define TRISB5                        1666
#define TRISB6                        1667
#define TRISB7                        1668
#define TRISC                         1669
#define TRISC0                        1670
#define TRISC1                        1671
#define TRISC2                        1672
#define TRISC3                        1673
#define TRISC4                        1674
#define TRISC5                        1675
#define TRISC6                        1676
#define TRISC7                        1677
#define TRISD                         1678
#define TRISD0                        1679
#define TRISD1                        1680
#define TRISD2                        1681
#define TRISD3                        1682
#define TRISD4                        1683
#define TRISD5                        1684
#define TRISD6                        1685
#define TRISD7                        1686
#define TRISE                         1687
#define TRISE0                        1688
#define TRISE1                        1689
#define TRISE2                        1690
#define TRISE3                        1691
#define TRISE4                        1692
#define TRISE5                        1693
#define TRISE6                        1694
#define TRISE7                        1695
#define TRISF                         1696
#define TRISF1                        1697
#define TRISF2                        1698
#define TRISF3                        1699
#define TRISF4                        1700
#define TRISF5                        1701
#define TRISF6                        1702
#define TRISF7                        1703
#define TRISG                         1704
#define TRISG0                        1705
#define TRISG1                        1706
#define TRISG2                        1707
#define TRISG3                        1708
#define TRISG4                        1709
#define TRISH                         1710
#define TRISH0                        1711
#define TRISH1                        1712
#define TRISH2                        1713
#define TRISH3                        1714
#define TRISH4                        1715
#define TRISH5                        1716
#define TRISH6                        1717
#define TRISH7                        1718
#define TRISJ                         1719
#define TRISJ0                        1720
#define TRISJ1                        1721
#define TRISJ2                        1722
#define TRISJ3                        1723
#define TRISJ4                        1724
#define TRISJ5                        1725
#define TRISJ6                        1726
#define TRISJ7                        1727
#define OSCTUNE                       1728
#define TUN0                          1729
#define TUN                           1730
#define TUN1                          1731
#define TUN2                          1732
#define TUN3                          1733
#define TUN4                          1734
#define TUN5                          1735
#define PLLEN                         1736
#define INTSRC                        1737
#define PSTR1CON                      1738
#define PSTR1CON_STRA                 1739
#define PSTR1CON_STRB                 1740
#define PSTR1CON_STRC                 1741
#define PSTR1CON_STRD                 1742
#define PSTR1CON_STRSYNC              1743
#define PSTR1CON_CMPL0                1744
#define PSTR1CON_CMPL                 1745
#define PSTR1CON_CMPL1                1746
#define PIE1                          1747
#define TMR1IE                        1748
#define TMR2IE                        1749
#define TMR1GIE                       1750
#define SSP1IE                        1751
#define SSPIE                         1752
#define TXIE                          1753
#define TX1IE                         1754
#define RCIE                          1755
#define RC1IE                         1756
#define ADIE                          1757
#define PIR1                          1758
#define TMR1IF                        1759
#define TMR2IF                        1760
#define TMR1GIF                       1761
#define SSPIF                         1762
#define SSP1IF                        1763
#define TXIF                          1764
#define TX1IF                         1765
#define RCIF                          1766
#define RC1IF                         1767
#define ADIF                          1768
#define IPR1                          1769
#define TMR1IP                        1770
#define TMR2IP                        1771
#define TMR1GIP                       1772
#define SSPIP                         1773
#define SSP1IP                        1774
#define TX1IP                         1775
#define TXIP                          1776
#define RCIP                          1777
#define RC1IP                         1778
#define ADIP                          1779
#define PIE2                          1780
#define TMR3GIE                       1781
#define TMR3IE                        1782
#define HLVDIE                        1783
#define LVDIE                         1784
#define BCL1IE                        1785
#define BCLIE                         1786
#define BCL2IE                        1787
#define SSP2IE                        1788
#define OSCFIE                        1789
#define PIR2                          1790
#define TMR3GIF                       1791
#define TMR3IF                        1792
#define HLVDIF                        1793
#define LVDIF                         1794
#define BCLIF                         1795
#define BCL1IF                        1796
#define BCL2IF                        1797
#define SSP2IF                        1798
#define OSCFIF                        1799
#define IPR2                          1800
#define TMR3GIP                       1801
#define TMR3IP                        1802
#define HLVDIP                        1803
#define LVDIP                         1804
#define BCLIP                         1805
#define BCL1IP                        1806
#define BCL2IP                        1807
#define SSP2IP                        1808
#define OSCFIP                        1809
#define PIE3                          1810
#define RXB0IE                        1811
#define RTCCIE                        1812
#define RXBNIE                        1813
#define CCP1IE                        1814
#define RXB1IE                        1815
#define CCP2IE                        1816
#define TXB0IE                        1817
#define CTMUIE                        1818
#define TXB1IE                        1819
#define TXBNIE                        1820
#define TXB2IE                        1821
#define TX2IE                         1822
#define RC2IE                         1823
#define LCDIE                         1824
#define TMR5GIE                       1825
#define PIR3                          1826
#define RTCCIF                        1827
#define RXBNIF                        1828
#define CCP1IF                        1829
#define CCP2IF                        1830
#define CTMUIF                        1831
#define TXBNIF                        1832
#define TX2IF                         1833
#define RC2IF                         1834
#define LCDIF                         1835
#define TMR5GIF                       1836
#define IPR3                          1837
#define RTCCIP                        1838
#define CCP1IP                        1839
#define RXBNIP                        1840
#define CCP2IP                        1841
#define CTMUIP                        1842
#define TX2IP                         1843
#define TXBNIP                        1844
#define RC2IP                         1845
#define LCDIP                         1846
#define TMR5GIP                       1847
#define PIR6                          1848
#define CMP1IF                        1849
#define CMP2IF                        1850
#define CMP3IF                        1851
#define EEIF                          1852
#define HLVDCON                       1853
#define HLVDL                         1854
#define HLVDL0                        1855
#define HLVDL1                        1856
#define HLVDL2                        1857
#define HLVDL3                        1858
#define HLVDEN                        1859
#define IRVST                         1860
#define BGVST                         1861
#define VDIRMAG                       1862
#define IPR6                          1863
#define CMP1IP                        1864
#define CMP2IP                        1865
#define CMP3IP                        1866
#define EEIP                          1867
#define T1GCON                        1868
#define T1GSS0                        1869
#define T1GSS                         1870
#define T1GSS1                        1871
#define T1GVAL                        1872
#define T1GGO_nT1DONE                 1873
#define nT1DONE                       1874
#define T1GGO_NOT_T1DONE              1875
#define NOT_T1DONE                    1876
#define T1GGO                         1877
#define T1GSPM                        1878
#define T1GTM                         1879
#define T1GPOL                        1880
#define TMR1GE                        1881
#define RCSTA1                        1882
#define RCSTA1_RX9D                   1883
#define RX9D1                         1884
#define RCD8                          1885
#define RCSTA1_OERR                   1886
#define OERR1                         1887
#define RCSTA1_FERR                   1888
#define FERR1                         1889
#define RCSTA1_ADDEN                  1890
#define ADDEN1                        1891
#define ADEN                          1892
#define RCSTA1_CREN                   1893
#define CREN1                         1894
#define SRENA                         1895
#define SREN1                         1896
#define RCSTA1_SREN                   1897
#define RC8_9                         1898
#define RCSTA1_RX9                    1899
#define nRC8                          1900
#define NOT_RC8                       1901
#define RC9                           1902
#define RX91                          1903
#define RCSTA1_SPEN                   1904
#define SPEN1                         1905
#define TXSTA1                        1906
#define TX9D1                         1907
#define TXSTA1_TX9D                   1908
#define TXD8                          1909
#define TRMT1                         1910
#define TXSTA1_TRMT                   1911
#define BRGH1                         1912
#define TXSTA1_BRGH                   1913
#define TXSTA1_SENDB                  1914
#define SENDB1                        1915
#define TXSTA1_SYNC                   1916
#define SYNC1                         1917
#define TXEN1                         1918
#define TXSTA1_TXEN                   1919
#define TX91                          1920
#define TX8_9                         1921
#define NOT_TX8                       1922
#define nTX8                          1923
#define TXSTA1_TX9                    1924
#define TXSTA1_CSRC                   1925
#define CSRC1                         1926
#define TXREG1                        1927
#define RCREG1                        1928
#define SPBRG1                        1929
#define T3GCON                        1930
#define T3GSS0                        1931
#define T3GSS                         1932
#define T3GSS1                        1933
#define T3GVAL                        1934
#define T3GGO                         1935
#define NOT_T3DONE                    1936
#define nT3DONE                       1937
#define T3GGO_nT3DONE                 1938
#define T3GGO_NOT_T3DONE              1939
#define T3GSPM                        1940
#define T3GTM                         1941
#define T3GPOL                        1942
#define TMR3GE                        1943
#define T3CON                         1944
#define TMR3ON                        1945
#define T3CON_RD16                    1946
#define nT3SYNC                       1947
#define NOT_T3SYNC                    1948
#define SOSCEN3                       1949
#define T3CON_SOSCEN                  1950
#define T3CKPS0                       1951
#define T3CKPS                        1952
#define T3CKPS1                       1953
#define TMR3CS0                       1954
#define TMR3CS                        1955
#define TMR3CS1                       1956
#define T3RD16                        1957
#define RD163                         1958
#define TMR3L                         1959
#define TMR3H                         1960
#define CMSTAT                        1961
#define CMSTAT_C1OUT                  1962
#define CMP1OUT                       1963
#define CMSTAT_C2OUT                  1964
#define CMP2OUT                       1965
#define CMP3OUT                       1966
#define CMSTAT_C3OUT                  1967
#define CVRCON                        1968
#define CVR                           1969
#define CVR0                          1970
#define CVR1                          1971
#define CVR2                          1972
#define CVR3                          1973
#define CVR4                          1974
#define CVRR                          1975
#define CVRSS                         1976
#define CVROEN                        1977
#define CVROE                         1978
#define CVREN                         1979
#define PIE4                          1980
#define CCP3IE                        1981
#define CCP4IE                        1982
#define CCP5IE                        1983
#define CCP6IE                        1984
#define CCP7IE                        1985
#define CCP8IE                        1986
#define CCP9IE                        1987
#define CCP10IE                       1988
#define PIR4                          1989
#define CCP3IF                        1990
#define CCP4IF                        1991
#define CCP5IF                        1992
#define CCP6IF                        1993
#define CCP7IF                        1994
#define CCP8IF                        1995
#define CCP9IF                        1996
#define CCP10IF                       1997
#define IPR4                          1998
#define CCP3IP                        1999
#define CCIP3IP                       2000
#define CCP4IP                        2001
#define CCP5IP                        2002
#define CCP6IP                        2003
#define CCP7IP                        2004
#define CCP8IP                        2005
#define CCP9IP                        2006
#define CCP10IP                       2007
#define PIE5                          2008
#define TMR4IE                        2009
#define TMR5IE                        2010
#define TMR6IE                        2011
#define TMR7IE                        2012
#define TMR8IE                        2013
#define TMR10IE                       2014
#define TMR12IE                       2015
#define TMR7GIE                       2016
#define PIR5                          2017
#define TMR4IF                        2018
#define TMR5IF                        2019
#define TMR6IF                        2020
#define TMR7IF                        2021
#define TMR8IF                        2022
#define TMR10IF                       2023
#define TMR12IF                       2024
#define TMR7GIF                       2025
#define CCP1CON                       2026
#define CCP1M0                        2027
#define CCP1M                         2028
#define CCP1M1                        2029
#define CCP1M2                        2030
#define CCP1M3                        2031
#define CCP1Y                         2032
#define DC1B                          2033
#define DC1B0                         2034
#define CCP1X                         2035
#define DC1B1                         2036
#define P1M                           2037
#define P1M0                          2038
#define P1M1                          2039
#define CCPR1L                        2040
#define CCPR1H                        2041
#define ECCP1DEL                      2042
#define P1DC                          2043
#define P1DC0                         2044
#define P1DC1                         2045
#define P1DC2                         2046
#define P1DC3                         2047
#define P1DC4                         2048
#define P1DC5                         2049
#define P1DC6                         2050
#define P1RSEN                        2051
#define PSS1BD0                       2052
#define PSS1BD                        2053
#define PSS1BD1                       2054
#define PSS1AC                        2055
#define PSS1AC0                       2056
#define PSS1AC1                       2057
#define ECCP1AS                       2058
#define ECCP1AS0                      2059
#define ECCP1AS1                      2060
#define ECCP1AS2                      2061
#define ECCP1ASE                      2062
#define ADCON2                        2063
#define ADCS0                         2064
#define ADCS                          2065
#define ADCS1                         2066
#define ADCS2                         2067
#define ACQT0                         2068
#define ACQT                          2069
#define ACQT1                         2070
#define ACQT2                         2071
#define ADFM                          2072
#define ADCON1                        2073
#define CHSN0                         2074
#define CHSN                          2075
#define CHSN1                         2076
#define CHSN2                         2077
#define VNCFG                         2078
#define CHSN3                         2079
#define VCFG                          2080
#define VCFG01                        2081
#define VCFG0                         2082
#define VCFG11                        2083
#define VCFG1                         2084
#define TRIGSEL                       2085
#define TRIGSEL0                      2086
#define TRIGSEL1                      2087
#define ADCON0                        2088
#define ADON                          2089
#define nDONE                         2090
#define GO_nDONE                      2091
#define NOT_DONE                      2092
#define GODONE                        2093
#define GO_DONE                       2094
#define DONE                          2095
#define GO_NOT_DONE                   2096
#define GO                            2097
#define CHS0                          2098
#define CHS                           2099
#define CHS1                          2100
#define CHS2                          2101
#define CHS3                          2102
#define CHS4                          2103
#define ADRESL                        2104
#define ADRESH                        2105
#define SSP1CON2                      2106
#define SEN1                          2107
#define SSP1CON2_SEN                  2108
#define ADMSK11                       2109
#define SSP1CON2_RSEN                 2110
#define RSEN1                         2111
#define SSP1CON2_ADMSK1               2112
#define SSP1CON2_PEN                  2113
#define ADMSK21                       2114
#define PEN1                          2115
#define SSP1CON2_ADMSK2               2116
#define ADMSK31                       2117
#define RCEN1                         2118
#define SSP1CON2_RCEN                 2119
#define SSP1CON2_ADMSK3               2120
#define SSP1CON2_ACKEN                2121
#define ACKEN1                        2122
#define ADMSK41                       2123
#define SSP1CON2_ADMSK4               2124
#define ACKDT1                        2125
#define ADMSK51                       2126
#define SSP1CON2_ACKDT                2127
#define SSP1CON2_ADMSK5               2128
#define SSP1CON2_ACKSTAT              2129
#define ACKSTAT1                      2130
#define GCEN1                         2131
#define SSP1CON2_GCEN                 2132
#define SSP1CON1                      2133
#define SSP1CON1_SSPM0                2134
#define SSPM01                        2135
#define SSP1CON1_SSPM                 2136
#define SSP1CON1_SSPM1                2137
#define SSPM11                        2138
#define SSP1CON1_SSPM2                2139
#define SSPM21                        2140
#define SSPM31                        2141
#define SSP1CON1_SSPM3                2142
#define SSP1CON1_CKP                  2143
#define CKP1                          2144
#define SSPEN1                        2145
#define SSP1CON1_SSPEN                2146
#define SSPOV1                        2147
#define SSP1CON1_SSPOV                2148
#define WCOL1                         2149
#define SSP1CON1_WCOL                 2150
#define SSP1STAT                      2151
#define BF1                           2152
#define SSP1STAT_BF                   2153
#define UA1                           2154
#define SSP1STAT_UA                   2155
#define SSP1STAT_R_NOT_W              2156
#define RW1                           2157
#define NOT_W                         2158
#define SSP1STAT_R                    2159
#define SSP1STAT_nW                   2160
#define RW                            2161
#define SSP1STAT_READ_WRITE           2162
#define SSP1STAT_nWRITE               2163
#define SSP1STAT_I2C_READ             2164
#define SSP1STAT_R_W                  2165
#define SSP1STAT_NOT_WRITE            2166
#define SSP1STAT_R_nW                 2167
#define SSP1STAT_S                    2168
#define START                         2169
#define SSP1STAT_I2C_START            2170
#define START1                        2171
#define STOP                          2172
#define SSP1STAT_P                    2173
#define STOP1                         2174
#define SSP1STAT_I2C_STOP             2175
#define SSP1STAT_D                    2176
#define SSP1STAT_D_NOT_A              2177
#define NOT_A                         2178
#define SSP1STAT_D_A                  2179
#define SSP1STAT_D_nA                 2180
#define SSP1STAT_NOT_ADDRESS          2181
#define SSP1STAT_nA                   2182
#define DA1                           2183
#define DA                            2184
#define SSP1STAT_I2C_DAT              2185
#define SSP1STAT_nADDRESS             2186
#define SSP1STAT_DATA_ADDRESS         2187
#define SSP1STAT_CKE                  2188
#define CKE1                          2189
#define SSP1STAT_SMP                  2190
#define SMP1                          2191
#define SSP1ADD                       2192
#define SSP1ADD_MSK0                  2193
#define MSK01                         2194
#define SSPADD                        2195
#define SSP1ADD_MSK1                  2196
#define MSK11                         2197
#define SSP1ADD_MSK2                  2198
#define MSK21                         2199
#define MSK31                         2200
#define SSP1ADD_MSK3                  2201
#define SSP1ADD_MSK4                  2202
#define MSK41                         2203
#define MSK51                         2204
#define SSP1ADD_MSK5                  2205
#define MSK61                         2206
