tiborsimon/embedded-tdd-headers/pic/8bit/pic18f87k90_tdd.h
#define SSP1ADD_MSK6                  2207
#define SSP1ADD_MSK7                  2208
#define MSK71                         2209
#define SSP1BUF                       2210
#define SSPBUF                        2211
#define T2CON                         2212
#define T2CKPS0                       2213
#define T2CKPS                        2214
#define T2CKPS1                       2215
#define TMR2ON                        2216
#define T2OUTPS0                      2217
#define T2OUTPS                       2218
#define T2OUTPS1                      2219
#define T2OUTPS2                      2220
#define T2OUTPS3                      2221
#define WM0                           2222
#define PR2                           2223
#define WM1                           2224
#define WAIT0                         2225
#define WAIT1                         2226
#define EBDIS                         2227
#define TMR2                          2228
#define T1CON                         2229
#define TMR1ON                        2230
#define T1CON_RD16                    2231
#define NOT_T1SYNC                    2232
#define nT1SYNC                       2233
#define T1OSCEN                       2234
#define T1CON_SOSCEN                  2235
#define T1CKPS0                       2236
#define T1CKPS                        2237
#define T1CKPS1                       2238
#define TMR1CS0                       2239
#define TMR1CS                        2240
#define T1RD16                        2241
#define TMR1CS1                       2242
#define TMR1L                         2243
#define TMR1H                         2244
#define RCON                          2245
#define BOR                           2246
#define NOT_BOR                       2247
#define nBOR                          2248
#define POR                           2249
#define nPOR                          2250
#define NOT_POR                       2251
#define PD                            2252
#define nPD                           2253
#define NOT_PD                        2254
#define nTO                           2255
#define TO                            2256
#define NOT_TO                        2257
#define nRI                           2258
#define NOT_RI                        2259
#define RI                            2260
#define NOT_CM                        2261
#define CM                            2262
#define nCM                           2263
#define SBOREN                        2264
#define IPEN                          2265
#define WDTCON                        2266
#define SWDTEN                        2267
#define SWDTE                         2268
#define ULPSINK                       2269
#define ULPEN                         2270
#define SRETEN                        2271
#define ULPLVL                        2272
#define REGSLP                        2273
#define IPR5                          2274
#define CCH05                         2275
#define TMR4IP                        2276
#define CCH15                         2277
#define TMR5IP                        2278
#define TMR6IP                        2279
#define EVPOL05                       2280
#define TMR7IP                        2281
#define EVPOL15                       2282
#define TMR8IP                        2283
#define TMR10IP                       2284
#define TMR12IP                       2285
#define TMR7GIP                       2286
#define OSCCON                        2287
#define SCS0                          2288
#define SCS                           2289
#define SCS1                          2290
#define HFIOFS                        2291
#define OSTS                          2292
#define IRCF                          2293
#define IRCF0                         2294
#define IRCF1                         2295
#define IRCF2                         2296
#define IDLEN                         2297
#define SPBRGH1                       2298
#define T0CON                         2299
#define T0PS                          2300
#define T0PS0                         2301
#define T0PS1                         2302
#define T0PS2                         2303
#define PSA                           2304
#define T0SE                          2305
#define T0CS                          2306
#define T08BIT                        2307
#define TMR0ON                        2308
#define TMR0L                         2309
#define TMR0H                         2310
#define STATUS                        2311
#define C                             2312
#define CARRY                         2313
#define DC                            2314
#define ZERO                          2315
#define Z                             2316
#define OV                            2317
#define OVERFLOW                      2318
#define N                             2319
#define NEGATIVE                      2320
#define FSR2L                         2321
#define PLUSW2                        2322
#define PREINC2                       2323
#define POSTDEC2                      2324
#define POSTINC2                      2325
#define INDF2                         2326
#define FSR1L                         2327
#define PLUSW1                        2328
#define PREINC1                       2329
#define POSTDEC1                      2330
#define POSTINC1                      2331
#define INDF1                         2332
#define WREG                          2333
#define FSR0L                         2334
#define PLUSW0                        2335
#define PREINC0                       2336
#define POSTDEC0                      2337
#define POSTINC0                      2338
#define INDF0                         2339
#define INTCON3                       2340
#define INT1IF                        2341
#define INT1F                         2342
#define INT2IF                        2343
#define INT2F                         2344
#define INT3F                         2345
#define INT3IF                        2346
#define INT1E                         2347
#define INT1IE                        2348
#define INT2IE                        2349
#define INT2E                         2350
#define INT3E                         2351
#define INT3IE                        2352
#define INT1P                         2353
#define INT1IP                        2354
#define INT2IP                        2355
#define INT2P                         2356
#define INTCON2                       2357
#define RBIP                          2358
#define INT3IP                        2359
#define INT3P                         2360
#define TMR0IP                        2361
#define T0IP                          2362
#define INTEDG3                       2363
#define INTEDG2                       2364
#define INTEDG1                       2365
#define INTEDG0                       2366
#define RBPU                          2367
#define NOT_RBPU                      2368
#define nRBPU                         2369
#define INTCON                        2370
#define RBIF                          2371
#define INT0F                         2372
#define INT0IF                        2373
#define T0IF                          2374
#define TMR0IF                        2375
#define RBIE                          2376
#define INT0E                         2377
#define INT0IE                        2378
#define T0IE                          2379
#define TMR0IE                        2380
#define PEIE                          2381
#define PEIE_GIEL                     2382
#define GIEL                          2383
#define GIE_GIEH                      2384
#define GIE                           2385
#define GIEH                          2386
#define PRODL                         2387
#define PRODH                         2388
#define TABLAT                        2389
#define TBLPTRL                       2390
#define TBLPTRH                       2391
#define PCL                           2392
#define PCLATH                        2393
#define PCH                           2394
#define SP0                           2395
#define STKPTR                        2396
#define SP1                           2397
#define SP2                           2398
#define SP3                           2399
#define SP4                           2400
#define STKUNF                        2401
#define STKOVF                        2402
#define STKFUL                        2403
#define TOSL                          2404
#define TOSH                          2405

#endif // _PIC18F87K90_H_
